#+TITLE: Cluster bike sharing stations in french cities
#+AUTHOR: Damien Garaud <damien.garaud@oslandia.com>, Raphaël Delhome <raphael.delhome@oslandia.com>

[[http://oslandia.com/][Oslandia]] team is involved in a constant effort in geospatial data gathering and
analysis. By taking advantage of the recent trend in public open data
releasing, and after reading an inspiring work done by James Lawlor for [[https://towardsdatascience.com/usage-patterns-of-dublin-bikes-stations-484bdd9c5b9e][Dublin
data]], we decided to evaluate the situation in our own living places. Here comes
the open data portals for both cities: [[https://data.grandlyon.com/][Lyon]] and [[http://opendata.bordeaux.fr/][Bordeaux]].

* What is the data looking like?

Both data set have been gathered with a cron plugged onto open data portals to
get data every 5 minutes. The data of this study are between the 8th of July and
the 26th of September, /i.e./ more than 11 weeks of data.

It is important to consider there is no real standardization relatively to bike
sharing open data sets: each city provide its own data set with its own
features.

Around Lyon the data set is as follows:

#+BEGIN_SRC ipython :session openbike :exports results
import pandas as pd
lyon = pd.read_csv("../data/lyon.csv", parse_dates=["last_update"])
lyon = lyon.sort_values(["number", "last_update"])
lyon.sample().T
#+END_SRC

#+RESULTS:
#+begin_example
                                   1928464
number                                2004
last_update            2017-07-30 01:08:53
bike_stands                             18
available_bike_stands                    9
available_bikes                          9
availabilitycode                         1
availability                          Vert
bonus                                  Non
status                                OPEN
#+end_example

Whereas for Bordeaux, a record is like:

#+BEGIN_SRC ipython :session openbike :exports results
bordeaux = pd.read_csv("../data/bordeaux.csv", parse_dates=["ts"])
bordeaux.sample().T
#+END_SRC

#+RESULTS:
:                              2263140
: gid                               74
: ident                             97
: type                            VLS+
: name                         Claveau
: state                      CONNECTEE
: available_stand                    9
: available_bike                    11
: ts               2017-08-27 15:04:03

However to investigate on bike availability patterns and provide clusters, we
only need station ids, timestamps and number of available bikes!

